app/Controllers/Admin.php

    public function index()
    {
        $session = session();
        if (!$session->get('logged_in') || $session->get('role') != 'admin') {
            return redirect()->to(base_url('auth/login'));
        }

        $productModel = new \App\Models\ProductModel();
        $userModel = new \App\Models\UserModel();
        $orderModel = new \App\Models\OrderModel(); // Pastikan model ini ada

        // Hitung Data
        $total_produk = $productModel->countAll();
        $total_pelanggan = $userModel->where('role', 'user')->countAllResults();
---
SELECT COUNT(*) AS `numrows` FROM `products`
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'user'

    public function products()
    {
        $menuModel = new \App\Models\MenuModel(); // Pastikan ini model yang tabelnya 'products'

        $data = [
            'title' => 'Kelola Produk - Coffee Time',
            'products' => $menuModel->findAll()
---
SELECT *
FROM `products`