app/Controllers/Auth.php

    public function process_login()
    {
        $session = session();
        $userModel = new UserModel();

        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        // 1. Cari user di database
        $data = $userModel->where('username', $username)->first();
---
SELECT *
FROM `users`
WHERE `username` = 'admin'
 LIMIT 1