app/Controllers/Home.php

    public function menu()
    {
        // Panggil Model Database
        $model = new ProductModel();

        // Ambil semua data kopi
        $data['products'] = $model->findAll();
---
SELECT *
FROM `products`

    public function products()
    {
        $model = new ProductModel();
        $data['products'] = $model->findAll();
---
SELECT *
FROM `products`