app/Models/OrderModel.php

    public function getTransactionHistory()
    {
        // Kita gunakan Query Builder untuk meniru logika SQL "GROUP BY"
        // tujuannya menggabungkan menu yang dibeli di waktu yang sama menjadi satu baris
        return $this->db->table($this->table)
            ->select("
                customer_name,
                order_date,
                GROUP_CONCAT(CONCAT(item_name, ' (', quantity, ')') SEPARATOR ', ') as menu_list,
                SUM(price * quantity) as total_bayar
            ")
            ->groupBy(['user_id', 'order_date']) // Kelompokkan berdasarkan User & Waktu
            ->orderBy('order_date', 'DESC')      // Urutkan dari yang terbaru
            ->get()
            ->getResultArray();
---
SELECT `customer_name`, `order_date`, GROUP_CONCAT(CONCAT(item_name, ' (', `quantity`, ')') SEPARATOR ', ') as menu_list, SUM(price * quantity) as total_bayar
FROM `orders`
GROUP BY `user_id`, `order_date`
ORDER BY `order_date` DESC